In [1]:
# Name: Chaithra Kopparam Cheluvaiah
# Assignment: HW02 Data Preparation
# Date: Feb 06, 2022

Each of 5 schools (A, B, C, D and E) is implementing the same math course this semester, with 35 lessons. There are 30 sections total. The semester is about 3/4 of the way through.

For each section, we record the number of students who are:

- very ahead (more than 5 lessons ahead)
- middling  (5 lessons ahead to 0 lessons ahead)
- behind (1 to 5 lessons behind)
- more behind (6 to 10 lessons behind)
- very behind  (more than 10 lessons behind)
- completed (finished with the course)

**Whatâ€™s the story (or stories) in this data? Find it, and tell it visually and, above all, truthfully.**

In [3]:
# loading required libraries
import pandas as pd

In [21]:
# reading dataset into a dataframe
path = 'data-storyteller.csv'
grades = pd.read_csv(path, header=0, na_values='NA')

In [22]:
# viewing the data - first 5 rows
grades.head()

,School,Section,Very Ahead +5,Middling +0,Behind -1-5,More Behind -6-10,Very Behind -11,Completed
0,A,1,0,5,54,3,9,10
1,A,2,0,8,40,10,16,6
2,A,3,0,9,35,12,13,11
3,A,4,0,14,44,5,12,10
4,A,5,0,9,42,2,24,8

In [30]:
# modifying column names - removing spaces and digits
grades = grades.rename(columns={' Very Ahead +5':'VeryAhead', ' Middling +0':'Middling',' Behind -1-5':'Behind', 
                                'More Behind -6-10':'MoreBehind',' Very Behind -11':'VeryBehind', ' Completed':'Completed'})

In [35]:
grades.head()

,School,Section,VeryAhead,Middling,Behind,MoreBehind,VeryBehind,Completed
0,A,1,0,5,54,3,9,10
1,A,2,0,8,40,10,16,6
2,A,3,0,9,35,12,13,11
3,A,4,0,14,44,5,12,10
4,A,5,0,9,42,2,24,8

In [37]:
#Shape of data
grades.shape
print("Number of rows: ",grades.shape[0])
print("Number of columns: ",grades.shape[1])

Number of rows:  30
Number of columns:  8

In [38]:
#Datatypes of each field
grades.dtypes

School        object
Section        int64
VeryAhead      int64
Middling       int64
Behind         int64
MoreBehind     int64
VeryBehind     int64
Completed      int64
dtype: object

In [32]:
# checking for data types and null values
grades.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   School      30 non-null     object
 1   Section     30 non-null     int64
 2   VeryAhead   30 non-null     int64
 3   Middling    30 non-null     int64
 4   Behind      30 non-null     int64
 5   MoreBehind  30 non-null     int64
 6   VeryBehind  30 non-null     int64
 7   Completed   30 non-null     int64
dtypes: int64(7), object(1)
memory usage: 2.0+ KB

In [40]:
#Checking for null values
grades.isnull().sum()

# There are no null values

School        0
Section       0
VeryAhead     0
Middling      0
Behind        0
MoreBehind    0
VeryBehind    0
Completed     0
dtype: int64

In [42]:
#Checking for NA values
grades.isna().sum()

# There are no NA values

School        0
Section       0
VeryAhead     0
Middling      0
Behind        0
MoreBehind    0
VeryBehind    0
Completed     0
dtype: int64

In [66]:
# exploring the data
for name in grades.columns:
    print(grades[name].value_counts())

A    13
B    12
C     3
D     1
E     1
Name: School, dtype: int64
1     5
2     3
3     3
4     2
5     2
6     2
7     2
8     2
9     2
10    2
11    2
12    2
13    1
Name: Section, dtype: int64
0    30
Name: VeryAhead, dtype: int64
8     4
10    4
9     3
7     3
3     3
2     3
5     2
6     2
4     2
14    1
19    1
13    1
11    1
Name: Middling, dtype: int64
29    2
22    2
8     2
7     2
40    2
21    2
54    1
11    1
4     1
20    1
15    1
17    1
19    1
23    1
31    1
14    1
30    1
16    1
32    1
37    1
42    1
44    1
35    1
56    1
Name: Behind, dtype: int64
2     7
1     6
0     4
3     3
5     3
4     2
10    1
12    1
11    1
8     1
7     1
Name: MoreBehind, dtype: int64
1     5
0     3
3     2
6     2
12    2
10    2
2     2
5     2
7     1
4     1
9     1
8     1
16    1
18    1
14    1
24    1
13    1
15    1
Name: VeryBehind, dtype: int64
10    4
5     4
6     2
8     2
19    2
15    2
14    2
7     2
3     2
13    2
11    1
9     1
20    1
18    1
1     1
27    1
Name: Completed, dtype: int64